function distance=Distance(G,R1,C1)
%G是原图
%R1是对应的横坐标，左右
%C1是对应的纵坐标，上下
%distance是最后输出的距离总和
[x,y]=size(R1);
DIS=zeros(x,y);
for i=1:x
    for j=1:y
        if ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==0)
            DIS(i,j)=1;%领域内一个数没有
        elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==1)
            DIS(i,j)=1;%领域内只有四领域有一个数
        elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==0)
            DIS(i,j)=sqrt(2);%领域内只有D领域有一个数                          
        % G(R1(i,j),C1(i,j)+1) 上
        % G(R1(i,j),C1(i,j)-1) 下
        % G(R1(i,j)-1,C1(i,j) 左
        % G(R1(i,j)+1,C1(i,j) 右
        % G(R1(i,j)-1,C1(i,j)+1) 上左
        % G(R1(i,j)+1,C1(i,j)+1) 上右
        % G(R1(i,j)-1,C1(i,j)-1)下左
        % G(R1(i,j)+1,C1(i,j)-1) 下右
        %2
        elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==2)
        DIS(i,j)=1;%上、下、左、右中有两个等于1，其他为零
        elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==2)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==0)
        DIS(i,j)=sqrt(2);%上、下、左、右中有两个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=1;%上和上左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=1;%上和上右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=1;%下和下左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=1;%下和下右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=1;%左和上左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=1;%左和下左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=1;%右和上右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=1;%右和下右等于1，其他为零
        %
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%上和下左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(1+sqrt(2))/2;%上和下右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%下和上左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%下和上右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%左和上右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(1+sqrt(2))/2;%左和下右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%右和上左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%右和下左等于1，其他为零
        %3
        elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==3)
        DIS(i,j)=3/2;%上、下、左、右中有三个等于1，其他为零
        elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==3)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==0)
        DIS(i,j)=(3*sqrt(2))/2;%上左、下左、下左、下右中有三个等于1，其他为零
        %四领域一个，D领域两个
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%上、上左、下左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(1+sqrt(2))/2;%上、上左、下右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%上、上右、下左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(1+sqrt(2))/2;%上、上右、下右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%下、下左、上右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%下、下左、上左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(1+sqrt(2))/2;%下、下右、上右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(1+sqrt(2))/2;%下、下右、上左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%左、下左、上右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(1+sqrt(2))/2;%左、下左、下右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%左、上左、上右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(1+sqrt(2))/2;%左、上左、下右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(1+sqrt(2))/2;%右、下右、上左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(1+sqrt(2))/2;%右、下右、下左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%右、上右、上左等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(1+sqrt(2))/2;%右、上右、下左等于1，其他为零
        %四领域两个，D领域一个
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==1)
        DIS(i,j)=1;%上、下等于1，上左、上右、下左、下右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==1)
        DIS(i,j)=1;%左、右等于1，上左、上右、下左、下右等于1，其他为零
        %上左，上右
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)+1))+(G(R1(i,j)-1,C1(i,j)-1))+(G(R1(i,j)+1,C1(i,j)+1))==1)
        DIS(i,j)=1;%上、左、除了下右之外的有一个D领域的等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)+1))+(G(R1(i,j)-1,C1(i,j)-1))+(G(R1(i,j)+1,C1(i,j)+1))==0)
        DIS(i,j)=(2+sqrt(2))/2;%上、左、下右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)+1))+(G(R1(i,j)+1,C1(i,j)-1))+(G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=1;%上、右、除了下左之外的有一个D领域的等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)+1))+(G(R1(i,j)+1,C1(i,j)-1))+(G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(2+sqrt(2))/2;%上、左、下左等于1，其他为零
        %下左，下右
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)+1))+(G(R1(i,j)-1,C1(i,j)-1))+(G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=1;%下、左、除了上右之外的有一个D领域的等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)+1))+(G(R1(i,j)-1,C1(i,j)-1))+(G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=(2+sqrt(2))/2;%下、左、上右等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))+(G(R1(i,j)+1,C1(i,j)-1))+(G(R1(i,j)-1,C1(i,j)-1))==1)
        DIS(i,j)=1;%下、右、除了上左之外的有一个D领域的等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))+(G(R1(i,j)+1,C1(i,j)-1))+(G(R1(i,j)-1,C1(i,j)-1))==0)
        DIS(i,j)=(2+sqrt(2))/2;%上、右、上左等于1，其他为零
        %4
        elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==4)
        DIS(i,j)=2;%上、下、左、右等于1，其他为零
        elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==4)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==0)
        DIS(i,j)=(4*sqrt(2))/2;%上左、下左、下左、下右等于1，其他为
        %3-1
        elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==3)
        DIS(i,j)=3/2;%上、下、左、右中有三个等于1，上左、下左、下左、下右有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j),C1(i,j)-1))+(G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
            DIS(i,j)=(1+2*sqrt(2))/2;%上左、上右、下左等于1，右或者下中有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j),C1(i,j)+1))+(G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
            DIS(i,j)=(1+sqrt(2))/2;%上左、上右、下左等于1，左或者上中有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j),C1(i,j)-1))+(G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
            DIS(i,j)=(1+2*sqrt(2))/2;%上左、上右、下右等于1，左或者下中有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j),C1(i,j)+1))+(G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
            DIS(i,j)=(1+sqrt(2))/2;%上左、上右、下右等于1，右或者上中有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j),C1(i,j)+1))+(G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
            DIS(i,j)=(1+2*sqrt(2))/2;%下左、上右、下右等于1，左或者上中有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j),C1(i,j)-1))+(G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
            DIS(i,j)=(1+sqrt(2))/2;%下左、上右、下右等于1，右或者下中有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j),C1(i,j)+1))+(G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
            DIS(i,j)=(1+2*sqrt(2))/2;%上左、下左、下右等于1，右或者上中有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j),C1(i,j)-1))+(G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
            DIS(i,j)=(1+sqrt(2))/2;%上左、下左、下右等于1，左或者下中有一个等于1，其他为零
        %2-2
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)+1,C1(i,j)))+(G(R1(i,j)-1,C1(i,j)))==2)&&((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==3)
        DIS(i,j)=(1+sqrt(2))/2;%左右等于1，D领域中任意两个等于1，其他为零
        elseif ((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j),C1(i,j)-1))+(G(R1(i,j),C1(i,j)+1))==2)&&((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==3)
        DIS(i,j)=(1+sqrt(2))/2;%上下等于1，D领域中任意两个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==2)&&((G(R1(i,j)-1,C1(i,j)+1))==0)
        DIS(i,j)=1;%上左为1、除下右之外的D领域中有两个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)+1))==1)
        DIS(i,j)=(2+sqrt(2))/2;%上左为1、下右等于1，除下右之外的D领域中有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==2)&&((G(R1(i,j)-1,C1(i,j)-1))==0)
        DIS(i,j)=1;%上右为1、除下左之外的D领域中有两个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==1)&&((G(R1(i,j),C1(i,j)-1))==0)&&((G(R1(i,j)-1,C1(i,j)))==0)&&((G(R1(i,j)+1,C1(i,j)))==1)&&((G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j)-1))==1)
        DIS(i,j)=(2+sqrt(2))/2;%上右为1、下左等于1，除下左之外的D领域中有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)-1))==2)&&((G(R1(i,j)+1,C1(i,j)+1))==0)
        DIS(i,j)=1;%下左为1、除右上之外的D领域中有两个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)+1))==1)
        DIS(i,j)=(2+sqrt(2))/2;%下左为1、右上等于1，除右上之外的D领域中有一个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)+1)+G(R1(i,j)-1,C1(i,j)-1))==2)&&((G(R1(i,j)+1,C1(i,j)-1))==0)
        DIS(i,j)=1;%下右为1、除左上之外的D领域中有两个等于1，其他为零
        elseif ((G(R1(i,j),C1(i,j)+1))==0)&&((G(R1(i,j),C1(i,j)-1))==1)&&((G(R1(i,j)-1,C1(i,j)))==1)&&((G(R1(i,j)+1,C1(i,j)))==0)&&((G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)+1)+G(R1(i,j)-1,C1(i,j)-1))==1)&&((G(R1(i,j)+1,C1(i,j)-1))==1)
        DIS(i,j)=(2+sqrt(2))/2;%下右为1、左上等于1，除左上之外的D领域中有一个等于1，其他为零       
%         elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==2)
%             DIS(i,j)=1;
%         elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==2)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==0)
%             DIS(i,j)=sqrt(2);
%         elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==1)
%             DIS(i,j)=(1+sqrt(2))/2;
%         elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==0)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==3)
%             DIS(i,j)=3/2;
%         elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==3)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==0)
%             DIS(i,j)=(3*sqrt(2))/2;
%         elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==2)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==1)
%             DIS(i,j)=(1+2*sqrt(2))/2;
%         elseif ((G(R1(i,j)-1,C1(i,j)-1)+G(R1(i,j)-1,C1(i,j)+1)+G(R1(i,j)+1,C1(i,j)-1)+G(R1(i,j)+1,C1(i,j)+1))==1)&&((G(R1(i,j)-1,C1(i,j))+G(R1(i,j)+1,C1(i,j))+G(R1(i,j),C1(i,j)-1)+G(R1(i,j),C1(i,j)+1))==2)
%             DIS(i,j)=(2+sqrt(2))/2;
        end
    end
end
distance=sum(DIS);
end